src/main/resources/static/memberAccount.html

<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />
    <title>My Website</title>
    <link rel="stylesheet" href="style.css">
</head>

<body>
<header>
    <nav>
        <ul class="nav-left">
            <li><a href="/" class="nav-link">Home</a></li>
        </ul>
        <ul class="nav-right">
            <li><a href="/memberAccount.html" class="nav-link">Account</a></li>
            <li><a href="/memberBenefits.html" class="nav-link">Benefits</a></li>
            <li><a href="/visitorReports.html" class="nav-link">Visitor Cards</a></li>
        </ul>
    </nav>
</header>
<main>
    <!-- Member Administration-->

    <div class="form-container">
        <h2>Register Member</h2>
        <form id="register-form">
            <label for="name">Name:</label>
            <input type="text" id="name" required />
            <label for="email">Email:</label>
            <input type="email" id="email" required />
            <button type="submit">Register</button>
        </form>
        <div id="register-result"></div>
    </div>

    <div class="form-container">
        <h2>Update Member Details</h2>
        <form id="update-form">
            <label for="member-id">Member ID:</label>
            <input type="text" id="member-id" required />
            <label for="new-email">New Email:</label>
            <input type="email" id="new-email" required />
            <button type="submit">Update</button>
        </form>
        <div id="update-result"></div>
    </div>

    <div class="form-container">
        <h2>Get Membership Info</h2>
        <form id="info-form">
            <label for="info-member-id">Member ID:</label>
            <input type="text" id="info-member-id" required />
            <button type="submit">Get Info</button>
        </form>
        <div id="info-result"></div>
    </div>
</main>
<script>
    class GlobalCustomException extends Error {
        constructor(message, statusCode) {
            super(message);
            this.statusCode = statusCode;
        }
    }
    const currentPage = window.location.pathname;
    const navLinks = document.querySelectorAll('.nav-link');

    navLinks.forEach(link => {
        if (link.getAttribute('href') === currentPage) {
            link.classList.add('active');
        }
    });
    window.addEventListener("load", () => {
        window.addEventListener("resize", () => {
            if (window.innerWidth < 660) {
                window.resizeTo(660, window.innerHeight);
            }
        });
    });
    // Member Register Form
    document.getElementById("register-form").addEventListener("submit", async (event) => {
        event.preventDefault();
        const name = document.getElementById("name").value;
        const email = document.getElementById("email").value;

        const requestBody = `<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://services.saxonheritagecharity.example.com/">
                <soapenv:Header/>
                <soapenv:Body>
                    <ser:registerMember>
                        <ser:arg0>${name}</ser:arg0>
                        <ser:arg1>${email}</ser:arg1>
                    </ser:registerMember>
                </soapenv:Body>
            </soapenv:Envelope>`;

        const responseElement = document.getElementById("register-result");
        try {
            const response = await fetch("/soap-api/memberService", {
                method: "POST",
                headers: {
                    "Content-Type": "text/xml"
                },
                body: requestBody
            });

            const responseText = await response.text();
            responseElement.innerHTML = `<pre>${responseText}</pre>`;
        } catch (error) {
            responseElement.textContent = `Error: ${error.message}`;
        }
    });

    // Update Member Information
    document.getElementById("update-form").addEventListener("submit", async (event) => {
        event.preventDefault();
        const memberId = document.getElementById("member-id").value;
        const newEmail = document.getElementById("new-email").value;

        const requestBody = `<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://services.saxonheritagecharity.example.com/">
                <soapenv:Header/>
                <soapenv:Body>
                    <ser:updateMemberDetails>
                        <ser:arg0>${memberId}</ser:arg0>
                        <ser:arg1>${newEmail}</ser:arg1>
                    </ser:updateMemberDetails>
                </soapenv:Body>
            </soapenv:Envelope>`;

        const responseElement = document.getElementById("update-result");
        try {
            const response = await fetch("/soap-api/memberService", {
                method: "POST",
                headers: {
                    "Content-Type": "text/xml"
                },
                body: requestBody
            });

            const responseText = await response.text();
            responseElement.innerHTML = `<pre>${responseText}</pre>`;
        } catch (error) {
            responseElement.textContent = `Error: ${error.message}`;
        }
    });

    // Get Member Information
    document.getElementById("info-form").addEventListener("submit", async (event) => {
        event.preventDefault();
        const memberId = document.getElementById("info-member-id").value;

        const requestBody = `<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://services.saxonheritagecharity.example.com/">
                <soapenv:Header/>
                <soapenv:Body>
                    <ser:getMembershipInfo>
                        <ser:arg0>${memberId}</ser:arg0>
                    </ser:getMembershipInfo>
                </soapenv:Body>
            </soapenv:Envelope>`;

        const responseElement = document.getElementById("info-result");
        try {
            const response = await fetch("/soap-api/memberService", {
                method: "POST",
                headers: {
                    "Content-Type": "text/xml"
                },
                body: requestBody
            });

            const responseText = await response.text();
            responseElement.innerHTML = `<pre>${responseText}</pre>`;
        } catch (error) {
            responseElement.textContent = `Error: ${error.message}`;
        }
    });
</script>

</body>>
</html>